Revit 2027 API
ExternalResourceLoadContent.Version Property
 The version of the external data that the server is providing in this object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Version { get; set; }
Public Property Version As String
	Get
	Set
public:
property String^ Version {
	String^ get ();
	void set (String^ value);
}
member Version : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
When its LoadResource() method is invoked, an IExternalResourceServer can indicate the version of the data that it is providing to Revit by setting this property. Doing so will improve performance, because Revit will use the version information to avoid unnecessary reloads.
See GetResourceVersionStatus(ExternalResourceReference).
See Also
Reference
ExternalResourceLoadContent Class
Autodesk.Revit.DB Namespace